In [4]:
import pandas as pd

In [9]:
df_address= pd.read_csv( "data/address/address.csv", sep=";")
df_products= pd.read_csv( "data/products/products.csv", sep=";")
df_sales= pd.read_csv( "data/sales/sales.csv", sep=";")
df_salesdetails= pd.read_csv( "data/sales_details/sales_details.csv", sep=";")
df_users= pd.read_csv( "data/users/users.csv", sep=";")

In [10]:
df_users.head(1)

,id_cliente,nombre_completo,email,telefono,username,numero_documento,fecha_nacimiento
0,1,Ágata Caro,dafnejaume@diez-lerma.com,+34948 00 00 42,gabrielagullo,11403251,1988-09-13

In [11]:
df_address.head(1)

,id_direccion,id_cliente,descripcion,codigo_ciudad
0,1,14.0,"Avenida de Ibán Viña 13\r\nVizcaya, 54596",4106.0

In [12]:
df_products.head(1)

,id_producto,producto,descripcion,categoria,unidad,precio,is_active
0,1,Et,Occaecati ad laborum suscipit nostrum itaque.,hogar,lt,"159,08",VERDADERO

In [13]:
df_sales.head(1)

   id  fecha  id_cliente  direccion_id   total
0   1  45860          25            31  849,13

In [14]:
df_salesdetails.head(1)

   id_detalle  id_venta  id_producto  cantidad subtotal
0           1        12            5         3   796,98